export default {
  title1: '서울시 강남구 도산대로',
  title2: '139 제이타워 6층 pxd',
  title3: '오시는 길',
  sub1: '지하철 이용 시',
  desc1:
    '3호선 신사역 8번출구에서 나와 농협 지나 가로수길 입구에서 J-Tower(1층에 기업은행이 있는 TBWA건물) 6층으로 오시면 됩니다.',
  sub2: '버스 이용 시',
  desc2:
    '가까운 정류장은 신사역사거리.가로수길과 신사동고개 입니다. 다음 지도에서 자세한 버스 정보를 확인하세요.',
  link2: '카카오 지도 보기',
  sub3: '자가용 이용 시',
  desc3:
    '건물 지하 주차장 이용 가능하나, 주차비 지원은 안됩니다. 신사역쪽에서 오시는 경우, 건물 지나 첫번째 횡단보도에서 U턴 하시면 됩니다. 주차장 입구는 건물 북쪽에 있습니다.',
  link3: '네이버 지도 보기',
  project: '프로젝트 문의',
  info1: '메일',
  info2: '전화',
  info3: '팩스',
}
