export default {
  service: [
    {
      type: 'normal',
      visual: [
        {
          lang: 'en',
          title: 'UX / CX / SX',
        },
        {
          lang: 'en',
          title: 'Consulting',
        },
      ],
      desc: [
        {
          lang: 'en',
          title: 'User / Customer / Service Experience',
        },
        {
          lang: 'ko',
          title:
            '고객과 사용자의 근본적인 문제에서 출발하여 서비스와 제품이 나아갈 방향을 탐색합니다.',
        },
      ],
      detail: [
        {
          title: '사람에 대한 깊이 있는 이해에서 출발합니다.',
          desc: '서비스가 이루어지는 실제 상황에서의 맥락과 이해관계를 파악하여 근본적인 문제를 찾아냅니다. 사용자의 데이터를 분석하여 객관적 근거 위에서 가설을 수립합니다.',
        },
        {
          title: '비즈니스와 서비스의 목표를 고객의 관점으로 풀어냅니다.',
          desc: '디자인씽킹 프로세스를 통하여 조직 구성원들이 고객의 관점에서 서비스를 바라보고 서비스 경험 전략을 수립할 수 있게 합니다.',
        },
        {
          title: 'Ideation+Rapid Prototyping으로 실질적이고 혁신적인 해법을 탐색합니다.',
          desc: '추상적인 컨설팅 결과물이 아니라 현업 부서들이 참여하는 Ideation과 실제로 동작하는 Rapid Prototyping을 통하여 구체적이고 실질적인 해법을 제시합니다.',
        },
        {
          title: 'UX 컨설턴트와 디자이너, 프론트 개발팀이 협업하여 결과물을 만듭니다.',
          desc: 'UX 컨설팅의 성과가 마지막 인터랙션 요소까지 제대로 반영될 수 있도록 디자이너와 개발자가 유기적으로 협업합니다.',
        },
      ],
      button: '프로젝트 문의',
    },
    {
      type: 'normal',
      visual: [
        {
          lang: 'en',
          title: 'Data Driven',
        },
        {
          lang: 'en',
          title: 'UXD Process',
        },
      ],
      desc: [
        {
          lang: 'en',
          title:
            '데이터로 고객과 서비스를 이해하고 성과를 측정하여 근거에 기반한 디자인을 합니다.',
        },
      ],
      detail: [
        {
          lang: 'en',
          title: 'pxd Data Lab',
          desc: 'pxd의 데이터사이언티스트(Data-scientist)가 서비스 이용 데이터를 분석, 사용자를 이해하고 문제점을 진단하고 UX 인사이트를 도출합니다. 나아가 디자인의 지속적 개선을 위한 성과지표 관리를 할 수 있게 합니다.',
        },
        {
          lang: 'en',
          title: 'Data-driven User Modeling',
          desc: '사용자 로그 데이터의 객관적 분석을 통하여 사용 패턴을 발견하고 사용자 유형을 도출합니다. 기존의 에쓰노그래피컬 리서치 및 인터뷰 결과로 만들어진 사용자 모델을 검증 가능한 데이터로 보완하고 설득력을 높입니다.',
        },
        {
          lang: 'en',
          title: 'Evidence-based Design',
          desc: '디자인 시안 및 요소 개선에 관한 A/B Test, 개선 전후의 성과 측정을 통하여 데이터에 기반한 디자인 개선을 수행합니다. 가설수립 > 테스트 > 가설 수정과 디자인 개선 > 테스트...와 같은 반복 과정을 거쳐 지속적인 디자인 개선을 이루어냅니다.',
        },
        {
          lang: 'en',
          title: 'Performance Measurement',
          desc: 'UX개선의 목표를 측정 가능한 지표로 설정하고 이를 지속적 개선의 목표로 관리함으로써 비즈니스와 UX전략이 유기적인 연결성을 갖게 합니다. 또한 디자인 리뉴얼 후에 다음번 리뉴얼 때까지 방치되는 기존의 관행을 개선하여 끊임 없이 개선, 발전하는 서비스가 되게 합니다.',
        },
        {
          lang: 'en',
          title: 'UX Data Visualization Solution : ‘Beusable’',
          desc: 'pxd와 UX 데이터 시각화 및 분석 솔루션 ‘뷰저블(주식회사 포그리트)’이 2019년 업무협약을 체결하였습니다. 정성적이고 불분명한 서비스 사용자 경험을 정량적인 시각 데이터로 제공하여 UX컨설팅 결과의 성과를 높일 수 있게 되었습니다.',
        },
        {
          lang: 'en',
          title: 'Remote Mobile UT Platform : ‘Methinks’',
          desc: 'pxd는 샌프란시스코 소재의 원격 사용자 조사 서비스 플랫폼 기업 Methinks에 투자하고 있습니다. 국내는 물론 해외 사용자를 대상으로 하는 저비용의 빠른 테스트가 가능합니다.',
        },
      ],
      button: '프로젝트 문의',
    },
    {
      type: 'card',
      visual: [
        {
          lang: 'en',
          title: 'UX Tech Lab',
        },
      ],
      desc: [
        {
          title:
            '빠른 MVP 프로토타이핑으로 실패로부터 문제를 해결하고 새로운 UI와 인터랙션을 디자인하는 UX Tech Lab의 이상하고 재미있는 실험을 소개합니다.',
        },
      ],
      detail: [
        {
          img: 'img_service_03_01.png',
          href: 'https://story.pxd.co.kr/1084',
          title: '정류장 맥락을 고려한 버스 노선도 리디자인',
          desc: '현재 버스 정류장의 노선도는 해당 버스의 모든 노선을 표시하고 있어 현 위치에서 어디를 갈 수 있는지 알기 어렵습니다. 현재 정류장이라는 맥락에 따라 실제 버스의 운행 노선만을 표시하면 보다 이해하기 쉬운 노선도를 그릴 수 있습니다.',
        },
        {
          img: 'img_service_03_02.png',
          href: 'https://story.pxd.co.kr/1408',
          title: '서울시 생활 인구 코로플레스맵 시각화',
          desc: '서울시에서 공개한 생활 인구 정보를 보다 이해하기 쉽게 시각화해봤습니다. 생활인구는 주민등록의 거주자 정보가 아니라 휴대폰과 기지국 통신 이력을 기반으로 실제 서울에 생활하는 인구를 추계한 자료입니다. 시간, 성별, 연령, 행정동등 변수에 따른 인구수 변화를 한눈에 볼 수 있도록 했습니다.',
        },
        {
          img: 'img_service_03_03.png',
          href: 'https://story.pxd.co.kr/1126',
          title: '유아 한글 공부 키보드',
          desc: '아이가 처음 한글을 공부하는데 도움이 되는 키보드 앱 디자인하기. 우리가 일반적으로 사용하는 두벌식 자판은 다음 글자의 초성이 무조건 받침으로 들어와버리는 도깨비불 현상 때문에 처음 한글을 배우는 아이에게는 오히려 혼동이 되게 합니다. 키보드 프로토타이핑을 통해 아이의 반응을 관찰하여 디자인 개선을 진행하였습니다. 한글을 그냥 외우기 보다 스스로 한글의 규칙을 발견하고 퍼즐을 맞추듯 놀이를 통해 배울 수 있는 키보드를 만들었습니다.',
        },
        {
          img: 'img_service_03_04.png',
          href: 'http://speller.cs.pusan.ac.kr/',
          title: '한국어 맞춤법/문법 검사기 리디자인',
          desc: '부산대학교 인공지능연구실과 (주)나라인포테크가 제공하는 한국어 맞춤법/문법 검사기를 사용하다가 오류 표시와 교정을 함께 표시하면 좋겠다는 생각에 UI를 리디자인하여 제안하였습니다. 현재 제안한 UI가 공식사이트에 반영되어 서비스되고 있습니다.',
        },
        {
          img: 'img_service_03_05.png',
          href: 'http://lab.pxd.co.kr/touchkeyboard/mue128.html',
          title: '무이단모음 키보드 (128) 자판',
          desc: '학습성을 고려해서 기존 두벌식의 배열을 최대한 유지하면서 자소빈도가 낮은 키들를 합쳐, 키캡을 크게하여 오타가 적도록 한 한글 자판입니다. 양손 입력시 엄자손가락의 유효움직임 범위를 고려하여 자소를 배분하여 보다 수월하게 입력할 수 있도록 하였습니다. 현재 아이폰용 키보드가 2종 나와있습니다.',
        },
        {
          img: 'img_service_03_06.png',
          href: 'https://story.pxd.co.kr/683',
          title: '세상에서 가장 예쁜 날씨앱',
          desc: '아이폰의 기본 날씨앱이나 요즘 유행하는 미니멀한 날씨앱에서 날씨 정보를 확인하려면 인터랙션이 많아야 합니다. 한 눈에 모든 정보를 시각화 할 수 없을까요? 온도의 변화를 보다 쉽게 체감할 수 있게 어제와 비교해보는 그래프를 만들어보았습니다.',
        },
      ],
      button: 'UX Tech Lab 가기',
    },
    {
      type: 'normal',
      visual: [
        {
          lang: 'en',
          title: 'Rapid UX Design',
        },
        {
          lang: 'en',
          title: 'Process',
        },
      ],
      desc: [
        {
          lang: 'ko',
          title:
            '급변하는 비즈니스와 서비스 환경에 신속하게 대응하기 위해 pxd Design Consulting 방법론의 핵심을 축약하여 정립된 프로세스입니다. Rapid UX Design Process는 연간 단위 업무협약 유형의 과제에 최적화 되어 있으며, 이를 전담하는 조직이 수행합니다.',
        },
      ],
      detail: [
        {
          lang: 'en',
          title: 'Rapid UX Design Process',
          desc: 'Rapid UX Design Process 급변하는 비즈니스와 서비스 환경에 신속하게 대응하기 위해 pxd Design Consulting 방법론의 핵심을 축약하여 정립된 프로세스입니다. Rapid UX Design Process는 연간 단위 업무협약 유형의 과제에 최적화 되어 있으며, 이를 전담하는 조직이 수행합니다.',
        },
        {
          title: 'UX 프로세스를 진행할 여유가 없는 과제에 적합합니다.',
          desc: '많은 클라이언트들이 일정상의 이유로, 예산상의 이유로 UX디자인 프로세스를 그대로 따르기 어렵다고 이야기 합니다. 그러나 사용자를 이해하고 문제를 발견하고, 해법을 모색하고, 프로토타이핑을 통해 개선하고 디자인하는 과정은 결코 생략되지 않습니다. 단지 일정과 예산 등의 리소스의 제약으로 인해 사용자를 직접 만날 시간이 부족하거나 UX를 위한 근거자료의 확보, 의사결정 과정의 여유가 부족한 것입니다. 이럴 때일수록 프로세스 이해도가 높은 UX 전문가가 간접 자료의 확보와 레퍼런스 참고, 효과적인 가설 수립을 통하여 정확하고 빠른 프로젝트 운영이 필요합니다.',
        },
        {
          title: '연간 단위 업무일수록 현장 실무 경험이 많은 전문가가 필요합니다.',
          desc: '실제 운영중인 서비스의 짧고 빈번한 개선과 업데이트 업무는 주로 연간 계약 형태로 이루어집니다. 작은 업데이트일지라도 서비스 사용자들에게 바로 노출되고 서비스 품질과 매출에 직접적으로 영향을 주게 됩니다. 이 때문에 업데이트가 빈번한 운영 과제일수록 숙련된 전문가에 의해 빠르고 정확하게 이루어져야 합니다. pxd는 UX컨설팅 프로세스에 능숙하고 현장 실무 경험이 풍부한 전문 인력이 프로젝트 특성과 목표를 파악하여, ‘덜어내고, 압축하고, 라이브러리를 활용’하는 방식으로 최적화한 프로세스를 적용합니다.',
        },
        {
          title: 'pxd의 Rapid UX Design Process는 진화, 발전 중입니다.',
          desc: '변화하는 기술과 서비스 환경, 사용자 니즈의 변화, 개발환경의 변화에 따라 Rapid UX Design Process도 매년 변화, 발전하고 있습니다. pxd는 경험을 통해 얻어진 지식을 지속적으로 공유하고 있습니다.',
        },
      ],
      button: '프로젝트 문의',
    },
    {
      type: 'normal',
      visual: [
        {
          lang: 'ko',
          title: 'XE Group (경험개발그룹)',
        },
      ],
      desc: [
        {
          lang: 'ko',
          title:
            '경험개발그룹은 Front-End 기술을 활용해 UX(User eXperience) 구현 방법을 탐구하며 아키텍쳐 설계 및 개발을 합니다.',
        },
        {
          lang: 'en',
          title: 'Vue / React / Angular / Javascript',
        },
        {
          lang: 'en',
          title: 'HTML5 / CSS3 / Responsive Web',
        },
        {
          lang: 'en',
          title: 'Web & Mobile Accessibility / Consulting',
        },
      ],
      detail: [
        {
          title: 'UX 전략이 인터랙션 가능한 구체적인 결과물이 되도록 구현합니다.',
          desc: 'UX 전략이 공허한 말로만 끝나지 않고 실질적인 디자인 해법으로 연결되는 것이 중요합니다. 그리고 실제로 작동할 수 있는 개발 결과물이 되기까지 UX 전략이 살아 있어야 합니다. pxd는 이 전체의 과정을 하나의 디자인 프로세스로 인식하고 있으며 각 과정이 유기적으로 연결되어 시너지를 낼 수 있게 합니다.',
        },
        {
          lang: 'en',
          title: 'Interaction Prototyping',
          desc: '사소해 보이는 마이크로 트랜지션이나 인터랙션이 경험의 큰 차이를 만듭니다. 이는 UX에 대한 이해도가 높은 개발팀이 아이데이션 과정부터 참여하면서 지속적으로 테스트하고 발전시킬 수 있는 환경에서만 가능합니다.',
        },
        {
          lang: 'en',
          title: 'MVP(Minimum Viable Product) Prototyping',
          desc: '컨설팅과 기획, 디자인과 개발을 거쳐야만 결과물이 나오는 워터폴 방식의 프로세스로는 빠르게 변화하는 시장 환경에 기민하게 대응할 수 없습니다. 초반의 가설을 빠르게 MVP로 구현하고 이를 UX 컨설팅 과정에서 지속적으로 테스트하며 실질적인 결과물을 만들어나가야 합니다.',
        },
        {
          title: 'Front-end Development 및 Mobile / Web Publishing',
          desc: '모바일 및 웹 환경의 퍼블리싱과 Front-end 개발을 진행합니다. 접근성, 웹 표준, 검색엔진 최적화(S.E.O) 등을 고려하여 UX 컨설팅의 성과가 최종 개발 결과물까지 구현될 수 있게 합니다.',
        },
      ],
      button: '프로젝트 문의',
    },
  ],
}
